# IntegerValue Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ScheduleFieldId..::..IntegerValue Property
ScheduleFieldId Class See Also
---
Provides the value of the ScheduleFieldId as an integer.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public int IntegerValue { get; }
```

Visual Basic
---
```text
Public ReadOnly Property IntegerValue As Integer
	Get
```

Visual C++
---
```text
public:
property int IntegerValue {
	int get ();
}
```

# See Also
ScheduleFieldId Class
Autodesk.Revit.DB Namespace